package 设计模式.建造者模式.优化;

import 设计模式.建造者模式.套餐类;

public class 指挥者类 {

    public 套餐类 构造小霸王套餐(){
        return 套餐建造者类
                .准备套餐()
                .设置套餐名("小霸王套餐")
                .添加霸王鸡腿堡()
                .添加薯条()
                .添加可乐("小杯")
                .建造完成();
    }

    public 套餐类 构造大霸王套餐(){
        return 套餐建造者类.准备套餐()
                .设置套餐名("大霸王套餐")
                .添加双层霸王鸡腿堡()
                .添加上校鸡块()
                .添加可乐("中杯")
                .建造完成();
    }

    public 套餐类 构造至尊大霸王套餐(){
        return 套餐建造者类.准备套餐()
                .设置套餐名("至尊大霸王套餐")
                .添加双层霸王鸡腿堡()
                .添加上校鸡块()
                .添加薯条()
                .添加可乐("大杯")
                .建造完成();
    }
}
