package 设计模式.单例模式;

public class 测试类 {
    public static void main(String[] args) {
        网站计数器 计数器 = 网站计数器.获取唯一实例();
        计数器.点击数增加();
        System.out.println("当前网站点击量为："+计数器.获取点击数());
        网站计数器 计数器二 = 网站计数器.获取唯一实例();
        计数器二.点击数增加();
        计数器二.点击数增加();
        计数器二.点击数增加();
        System.out.println("当前网站点击量为："+计数器.获取点击数());
        网站计数器 计数器三 = 网站计数器.获取唯一实例();
        计数器三.点击数增加();
        计数器三.点击数增加();
        System.out.println("当前网站点击量为："+计数器.获取点击数());
        枚举类网站计数器 计数 = 枚举类网站计数器.唯一实例;
        System.out.println("当前网站点击量为："+计数.获取点击数());
        计数.点击数增加();
        System.out.println("当前网站点击量为："+计数.获取点击数());
        枚举类网站计数器 计数二 = 枚举类网站计数器.唯一实例;
        计数二.点击数增加();
        计数二.点击数增加();
        计数二.点击数增加();
        System.out.println("当前网站点击量为："+计数二.获取点击数());
        枚举类网站计数器 计数三 = 枚举类网站计数器.唯一实例;
        计数三.点击数增加();
        计数.点击数增加();
        计数三 = 计数二;
        计数三.点击数增加();
        System.out.println("当前网站点击量为："+计数.获取点击数());
    }
}
